{"pageProps":{"post":{"title":"Update for 2020","excerpt":"Long time no see, here's a small story about what happened the past few years and what's coming for 2020","created_at":"2020-09-24T10:00:00Z","slug":"2020-09-24-update-for-2020","content":"\nIt's been a while, but I'm finally back! 🎉\n\nWelcome to my new playground / blog / portfolio / resume. I hope you will enjoy spending time reading me!\n\nAs I started this blog, I was still a junior developer studying to get my master's degree. The purpose was to write about everything I was learning at the time. Today the goal has not changed, but I've been working on a lot of cool projects and have learned a lot.\n\nBack then, the focus was on putting my name out there on the Internet and therefore work on the SEO rather than on the visual aspect of the website.\n\nAfter months/years of reflection, sketch designs, prototypes, abandoned projects, I have finally achieved to build a website that I believe reflects my identity.\n\nWelcome to my new personal space.\n\nAs mentioned above, this will be some kind of playground. A place where I write about things I've discovered and try out new things. This was an opportunity for me to discover the React framework [Next.js](https://nextjs.org/) and more cool libraries that I will elaborate on in further posts. You can see this as my digital garden as explained in [this amazing post](https://joelhooks.com/digital-garden) from [@jhooks](https://twitter.com/jhooks).\n\nSo if you are interested in Javascript, React, Ruby on Rails, or just frontend stuff, feel free to follow me on Twitter to be informed of any new posts!\n\n*As a reminder, this is my playground, not a final version. Expect things to change in the future.*","readingTime":1,"related":"2020-09-24-case-study-nicolasthy","relatedPost":{"title":"Personnal Website Redesign","created_at":"2020-09-24T11:00:00Z","slug":"2020-09-24-case-study-nicolasthy","excerpt":"A quick overview of the work behind the new design of my website.","tags":["case study"],"published":true,"readingTime":2}}},"__N_SSG":true}